In [1]:
import pandas as pd

In [2]:
s = pd.Series([10,15,16,1,4,6,18,12,14,7])
s

0    10
1    15
2    16
3     1
4     4
5     6
6    18
7    12
8    14
9     7
dtype: int64

In [3]:
df = pd.DataFrame({
    "경찰수": [10,15,16,1,4,6,18,12,14,7],
    "범죄수": [5,2,1,9,7,8,1,5,3,6]
})
df

   경찰수  범죄수
0   10    5
1   15    2
2   16    1
3    1    9
4    4    7
5    6    8
6   18    1
7   12    5
8   14    3
9    7    6

In [4]:
df['경찰수']

0    10
1    15
2    16
3     1
4     4
5     6
6    18
7    12
8    14
9     7
Name: 경찰수, dtype: int64

In [7]:
df.head(6)

   경찰수  범죄수
0   10    5
1   15    2
2   16    1
3    1    9
4    4    7
5    6    8

In [8]:
df.index, df.columns, df.values

(RangeIndex(start=0, stop=10, step=1),
 Index(['경찰수', '범죄수'], dtype='object'),
 array([[10,  5],
        [15,  2],
        [16,  1],
        [ 1,  9],
        [ 4,  7],
        [ 6,  8],
        [18,  1],
        [12,  5],
        [14,  3],
        [ 7,  6]], dtype=int64))

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   경찰수     10 non-null     int64
 1   범죄수     10 non-null     int64
dtypes: int64(2)
memory usage: 288.0 bytes

In [10]:
df.describe()

             경찰수        범죄수
count  10.000000  10.000000
mean   10.300000   4.700000
std     5.638164   2.869379
min     1.000000   1.000000
25%     6.250000   2.250000
50%    11.000000   5.000000
75%    14.750000   6.750000
max    18.000000   9.000000

In [14]:
df.loc[2]

경찰수    16
범죄수     1
Name: 2, dtype: int64

In [15]:
df.iloc[2]

경찰수    16
범죄수     1
Name: 2, dtype: int64

In [16]:
df

   경찰수  범죄수
0   10    5
1   15    2
2   16    1
3    1    9
4    4    7
5    6    8
6   18    1
7   12    5
8   14    3
9    7    6

In [17]:
df.loc[2:5]

   경찰수  범죄수
2   16    1
3    1    9
4    4    7
5    6    8

In [19]:
df.iloc[2:6]

   경찰수  범죄수
2   16    1
3    1    9
4    4    7
5    6    8

In [24]:
df2 = pd.DataFrame(
    [[10, 20], [9, 10], [14, 9]],
    columns=['경찰수', '범죄수'],
    index=['A', 'B', 'C']
)
df2

   경찰수  범죄수
A   10   20
B    9   10
C   14    9

In [25]:
df2.loc['A']

경찰수    10
범죄수    20
Name: A, dtype: int64

In [27]:
df2.iloc[0]

경찰수    10
범죄수    20
Name: A, dtype: int64

In [37]:
df

   경찰수  범죄수
0   10    5
1   15    2
2   16    1
3    1    9
4    4    7
5    6    8
6   18    1
7   12    5
8   14    3
9    7    6

In [31]:
df['경찰수']

0    10
1    15
2    16
3     1
4     4
5     6
6    18
7    12
8    14
9     7
Name: 경찰수, dtype: int64

In [38]:
df.loc[:, '경찰수':'범죄수']

   경찰수  범죄수
0   10    5
1   15    2
2   16    1
3    1    9
4    4    7
5    6    8
6   18    1
7   12    5
8   14    3
9    7    6